---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionsOffset
source: html/36da3f8a-aade-7a18-39cf-c5b4c8dbbc56.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionsOffset Property

Identifies the offset of the segment length dimensions.

## Syntax (C#)
```csharp
public double SegmentLengthDimensionsOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for segmentLengthDimensionsOffset must be between 0 and 30000 feet.